Revit 2027 API
CompoundStructure.IsStructuralDeck Method
 Determines whether a specified layer is a structural deck.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsStructuralDeck(
	int layerIdx
)
Public Function IsStructuralDeck (
	layerIdx As Integer
) As Boolean
public:
bool IsStructuralDeck(
	int layerIdx
)
member IsStructuralDeck :
        layerIdx : int -> bool
Parameters
layerIdx Int32
 Index of a layer in the CompoundStructure.
Return Value
Boolean
 True if specified layer is a structural deck, and false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The layer index is out of range.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace